; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v4 - type_1 ?v8 - type_2)
 	      (pred_2 ?v6 - object ?v8 - type_2)
	      (pred_1 ?v4 - type_1 ?v1 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v7 ?v3 - type_2)
       :precondition (and  (pred_4 ?v4 ?v7))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_1 ?v5 - object ?v2 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v2) (pred_4 ?v4 ?v2) (pred_1 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v5 ?v1)
		    (not (pred_2 ?v5 ?v2)) 
		    (not (pred_1 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_1 ?v5 - object ?v2 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v5 ?v1) (pred_4 ?v4 ?v2))
       :effect (and (pred_2 ?v5 ?v2)
		    (pred_1 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_08 - type_1
obj_06 obj_07 obj_12 obj_05 - type_3
obj_10 obj_01 obj_02 obj_04 - type_2
obj_09 obj_03 obj_13 - object)
(:init
(pred_4 obj_11 obj_01)
(pred_1 obj_11 obj_06)
(pred_1 obj_11 obj_07)
(pred_4 obj_08 obj_04)
(pred_1 obj_08 obj_12)
(pred_1 obj_08 obj_05)
(pred_2 obj_09 obj_02)
(pred_2 obj_03 obj_10)
(pred_2 obj_13 obj_10)
)
(:goal
(and
(pred_2 obj_09 obj_04)
(pred_2 obj_03 obj_10)
(pred_2 obj_13 obj_02)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_11 obj_02) (pred_4 obj_08 obj_02))))
    (always (not (and (pred_4 obj_11 obj_04) (pred_4 obj_08 obj_04))))
  )
)
)

; plan
1. (op_1 obj_11 obj_01 obj_02)
   deleted: (pred_4 obj_11 obj_01)
   added: (pred_4 obj_11 obj_02)
   goals met: 1 of 3
2. (op_1 obj_08 obj_04 obj_10)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_10)
   goals met: 1 of 3
3. (op_2 obj_08 obj_13 obj_10 obj_05)
   deleted: (pred_2 obj_13 obj_10) (pred_1 obj_08 obj_05)
   added: (pred_3 obj_08 obj_13 obj_05)
   goals met: 1 of 3
4. (op_2 obj_11 obj_09 obj_02 obj_07)
   deleted: (pred_2 obj_09 obj_02) (pred_1 obj_11 obj_07)
   added: (pred_3 obj_11 obj_09 obj_07)
   goals met: 1 of 3
5. (op_1 obj_11 obj_02 obj_04)
   deleted: (pred_4 obj_11 obj_02)
   added: (pred_4 obj_11 obj_04)
   goals met: 1 of 3
6. (op_1 obj_08 obj_10 obj_02)
   deleted: (pred_4 obj_08 obj_10)
   added: (pred_4 obj_08 obj_02)
   goals met: 1 of 3
7. (op_3 obj_11 obj_09 obj_04 obj_07)
   deleted: (pred_3 obj_11 obj_09 obj_07)
   added: (pred_2 obj_09 obj_04) (pred_1 obj_11 obj_07)
   goals met: 2 of 3
8. (op_3 obj_08 obj_13 obj_02 obj_05)
   deleted: (pred_3 obj_08 obj_13 obj_05)
   added: (pred_2 obj_13 obj_02) (pred_1 obj_08 obj_05)
   goals met: 3 of 3
